In [1]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

In [2]:
train_data = pd.read_csv('Resources/train.csv')
test_data = pd.read_csv('Resources/test.csv')
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
train_data.shape

(891, 12)

In [4]:
train_data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [5]:
null_columns=train_data.columns[train_data.isnull().any()]

display(train_data[train_data["Embarked"].isnull()])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN

In [6]:
null_columns

Index(['Age', 'Cabin', 'Embarked'], dtype='object')

In [7]:
train_data["Embarked"] = train_data["Embarked"].fillna(method='ffill')

In [8]:
train_data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

In [9]:
train_data.drop(labels='Name', axis=1, inplace=True)

In [20]:
train_data.drop(labels='Cabin', axis=1, inplace=True)

ValueError: labels ['Cabin'] not contained in axis

In [21]:
cleanup_nums = {"Sex":     {"male": 0, "female": 1}}

In [22]:
train_data.replace(cleanup_nums, inplace=True)

In [23]:
train_data.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,0,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,1,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,1,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,1,35.0,1,0,113803,53.1000,S
4,5,0,3,0,35.0,0,0,373450,8.0500,S

In [24]:
train_data['Embarked'].unique()

array(['S', 'C', 'Q'], dtype=object)

In [25]:
cleanup_nums_2 = {"Embarked":     {"S": 0, "C": 1, 'Q': '2'}}

In [18]:
train_data.replace(cleanup_nums_2, inplace=True)

In [19]:
train_data_v2.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [ ]:
train_data.drop(labels='Ticket', axis=1, inplace=True)

In [ ]:
train_data.head()

In [ ]:
train_data.dropna(inplace=True)

In [ ]:
test = train_data.drop(labels='Survived', axis=1)

In [ ]:
test.head()


test.shape

In [ ]:
target = train_data['Survived']



target.shape

In [ ]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(test, target, random_state=42)

In [ ]:
X_train.shape

In [ ]:
X_test.shape

In [ ]:
from sklearn import tree

clf = tree.DecisionTreeClassifier()
clf = clf.fit(X_train, y_train)
clf.score(X_test, y_test)

In [ ]:
#Attempt 2

train_data.head()

In [ ]:
train_data_2 = train_data.drop(labels='PassengerId', axis=1)

In [ ]:
train_data_2.head()

train_data_2.isnull().sum()

In [ ]:
train_data_2.shape

In [ ]:
bins = [0,100,200,300,400,550]

fare_group_Cateogory = [0,1,2,3,4]

train_data_2['Fare'] = pd.cut(train_data_2['Fare'], bins, labels = fare_group_Cateogory)

In [ ]:
train_data_4 = train_data_2.dropna()

In [ ]:
train_data_4.shape

train_data_4.to_csv("AG_train-test_v2.csv")

In [ ]:
train_data_2.to_csv("AG_train-test.csv")

In [ ]:
test_2 = train_data_2.drop(labels='Survived', axis=1)

target_2 = train_data_2['Survived']

In [ ]:
test_2.dropna()

In [ ]:
target_2.isnull().sum()

In [ ]:

X_train_2, X_test_2, y_train_2, y_test_2 = train_test_split(test_2, target_2, random_state=42)

In [ ]:
clf = clf.fit(X_train_2, y_train_2)
clf.score(X_test_2, y_test_2)

# Attempt 3

In [ ]:
test_4 = train_data_4.drop(labels='Survived', axis=1)

target_4 = train_data_4['Survived']

In [ ]:
X_train_4, X_test_4, y_train_4, y_test_4 = train_test_split(test_4, target_4, random_state=42)

In [ ]:
clf = clf.fit(X_train_4, y_train_4)
clf.score(X_test_4, y_test_4)